app/Controllers/CheckinController.php

INSERT INTO `checkin` (`attendee_ID`, `first_name`, `last_name`, `email`, `phone`) VALUES ('100', 'Zegemule', 'Mzer', 'mog@tool.com', '08064901393')
---
                        ];

                        // Insert data
                        $checkInModel->insert($data);