app/Controllers/CheckinController.php

    public function checkin() {

        helper(['form']);

        $db = \config\Database::connect(); // Get DB
        $builder = $db->table('checkin');

        $regModel = new RegistrationModel();
        $regMetaModel = new RegistrationMetaModel();
        $checkInModel = new CheckinModel();

        if($_SERVER['REQUEST_METHOD'] === "POST") {

            $rules = [
                'attendeeId_input' => 'required|min_length[3]|max_length[3]|is_unique[checkin.attendee_ID]',
            ];

            if(! $this->validate($rules)) {
                $response = [
                    'status' => 400,
                    'message' => $this->validator->getErrors(),
                    'error' => true,
                    'data' => []
                ];
            } else {

                // Retreieve user data here
                $attendeeId_input = $this->request->getVar('attendeeId_input');

                // Check the registration table to find the user above with the submitted
                $attd_reg = $regModel->find($attendeeId_input);
---
SELECT *
FROM `registration`
WHERE `registration`.`attendee_ID` = '200'

                    // Then Check to see if attendee ID is already logged in the checkin table
                    // If already checked in then dont save into checkin table. Else save.
                    // $checkedAttendee =$builder->select('attendee_ID')->where('attendee_ID', $attendeeId_input);
                    $checkedAttendee = $checkInModel->find($attendeeId_input);
---
SELECT *
FROM `checkin`
WHERE `attendee_ID` = '103'

                        ];

                        // Insert data
                        $checkInModel->insert($data);
---
INSERT INTO `checkin` (`attendee_ID`, `first_name`, `last_name`, `email`, `phone`) VALUES ('105', 'Ortamen', 'Mzer', 'mue@tool.cog', '08064901345')