app/Controllers/DashboardController.php

SELECT *
FROM `checkin`
---
    public function checkedIn()
    {
        $checkedIn = new CheckinModel();
        $result = $checkedIn->findAll();