app/Controllers/RegistrationController.php

INSERT INTO `reg_meta` (`attendee_ID`, `residence_address`, `city_of_residence`, `state_of_residence`, `job_description`, `experience_level`) VALUES (102, 'Waziri Ibrahim', 'Victoria Island', 'Plateau', 'Robots Engineer', 'Over 5 Years')
---
                        ];

                        // Insert into meta table
                        $regMetaModel->insert($secData);